[NoCoverage] ArrowFunction
src/components/TheWelcome.vue:9:28
 import CommunityIcon from './icons/IconCommunity.vue'
 import SupportIcon from './icons/IconSupport.vue'
 
-const openReadmeInEditor = () => fetch('/__open-in-editor?file=README.md')
+const openReadmeInEditor = () => undefined
 </script>
 

[NoCoverage] StringLiteral
src/components/TheWelcome.vue:9:40
 import CommunityIcon from './icons/IconCommunity.vue'
 import SupportIcon from './icons/IconSupport.vue'
 
-const openReadmeInEditor = () => fetch('/__open-in-editor?file=README.md')
+const openReadmeInEditor = () => fetch("")
 </script>
 
