[Survived] StringLiteral
src/views/LoginView.vue:16:22
 const navigate = useRouter();
 
 const email = ref('');
-const password = ref('');
+const password = ref("Stryker was here!");
 
 const error = ref<string[]>([]);

[Killed] BlockStatement
src/views/LoginView.vue:20:22
 
 const error = ref<string[]>([]);
 
-const submit = () => {
-  const result = registerSchema.safeParse({ email: email.value, password: password.value });
-  if (!result.success) {
-    error.value = result.error.errors.map((e) => e.message);
-    return;
-  }
-  error.value = [];
-  signInWithEmailAndPassword(auth, result.data.email, result.data.password)
-    .then((userCredential) => {
-      const user = userCredential.user;
-      setUser(user.email!);
-      console.log(user);
-      navigate.push({ name: 'dashboard' });
-    })
-    .catch((error) => {
-      console.error(error);
-    });
-};
+const submit = () => {};
 </script>
 
killedBy: LoginView component should show error on invalid input
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/views/LoginView.vue:22:7
 
 const submit = () => {
   const result = registerSchema.safeParse({ email: email.value, password: password.value });
-  if (!result.success) {
+  if (false) {
     error.value = result.error.errors.map((e) => e.message);
     return;
killedBy: LoginView component should show error on invalid input
statusReason: expected 0 to be greater than 0

[NoCoverage] ArrayDeclaration
src/views/LoginView.vue:26:17
     error.value = result.error.errors.map((e) => e.message);
     return;
   }
-  error.value = [];
+  error.value = ["Stryker was here"];
   signInWithEmailAndPassword(auth, result.data.email, result.data.password)
     .then((userCredential) => {

[NoCoverage] BlockStatement
src/views/LoginView.vue:28:31
   }
   error.value = [];
   signInWithEmailAndPassword(auth, result.data.email, result.data.password)
-    .then((userCredential) => {
-      const user = userCredential.user;
-      setUser(user.email!);
-      console.log(user);
-      navigate.push({ name: 'dashboard' });
-    })
+    .then((userCredential) => {})
     .catch((error) => {
       console.error(error);

[NoCoverage] StringLiteral
src/views/LoginView.vue:32:29
       const user = userCredential.user;
       setUser(user.email!);
       console.log(user);
-      navigate.push({ name: 'dashboard' });
+      navigate.push({ name: "" });
     })
     .catch((error) => {
