[Killed] BooleanLiteral
src/composables/useFetch.ts:8:23
 
 const useFetch = <T>(url: string) => {
   const data = ref<T | null>(null);
-  const loading = ref(true);
+  const loading = ref(false);
   const error = ref<null | string>(null);
 
killedBy: useFetch devrait récupérer les données après le montage du composant
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] BlockStatement
src/composables/useFetch.ts:11:19
   const loading = ref(true);
   const error = ref<null | string>(null);
 
-  onMounted(() => {
-    waitFor(2000).then(() => {
-      fetch(url)
-        .then((response) => response.json())
-        .then((response) => {
-          data.value = response.results;
-        })
-        .catch((err: unknown) => {
-          //narrowing - instanceof - typeof
-          if (err instanceof Error) {
-            error.value = err.message;
-          } else if (typeof err === 'string') {
-            error.value = err;
-          } else {
-            error.value = 'An error occured';
-          }
-        })
-        .finally(() => {
-          loading.value = false;
-        });
-    });
-  });
+  onMounted(() => {});
 
   return { data, loading, error };
killedBy: useFetch devrait récupérer les données après le montage du composant
statusReason: expected "fetch" to be called with arguments: [ 'https://fakeapi.com/planets' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/composables/useFetch.ts:12:30
   const error = ref<null | string>(null);
 
   onMounted(() => {
-    waitFor(2000).then(() => {
-      fetch(url)
-        .then((response) => response.json())
-        .then((response) => {
-          data.value = response.results;
-        })
-        .catch((err: unknown) => {
-          //narrowing - instanceof - typeof
-          if (err instanceof Error) {
-            error.value = err.message;
-          } else if (typeof err === 'string') {
-            error.value = err;
-          } else {
-            error.value = 'An error occured';
-          }
-        })
-        .finally(() => {
-          loading.value = false;
-        });
-    });
+    waitFor(2000).then(() => {});
   });
 
killedBy: useFetch devrait récupérer les données après le montage du composant
statusReason: expected "fetch" to be called with arguments: [ 'https://fakeapi.com/planets' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/composables/useFetch.ts:15:29
     waitFor(2000).then(() => {
       fetch(url)
         .then((response) => response.json())
-        .then((response) => {
-          data.value = response.results;
-        })
+        .then((response) => {})
         .catch((err: unknown) => {
           //narrowing - instanceof - typeof
killedBy: useFetch devrait récupérer les données après le montage du composant
statusReason: expected null to deeply equal [ 'Mercure', 'Vénus', 'Terre' ]

[NoCoverage] BlockStatement
src/composables/useFetch.ts:18:34
         .then((response) => {
           data.value = response.results;
         })
-        .catch((err: unknown) => {
-          //narrowing - instanceof - typeof
-          if (err instanceof Error) {
-            error.value = err.message;
-          } else if (typeof err === 'string') {
-            error.value = err;
-          } else {
-            error.value = 'An error occured';
-          }
-        })
+        .catch((err: unknown) => {})
         .finally(() => {
           loading.value = false;

[NoCoverage] ConditionalExpression
src/composables/useFetch.ts:20:15
         })
         .catch((err: unknown) => {
           //narrowing - instanceof - typeof
-          if (err instanceof Error) {
+          if (false) {
             error.value = err.message;
           } else if (typeof err === 'string') {

[NoCoverage] ConditionalExpression
src/composables/useFetch.ts:20:15
         })
         .catch((err: unknown) => {
           //narrowing - instanceof - typeof
-          if (err instanceof Error) {
+          if (true) {
             error.value = err.message;
           } else if (typeof err === 'string') {

[NoCoverage] BlockStatement
src/composables/useFetch.ts:24:18
             error.value = err.message;
           } else if (typeof err === 'string') {
             error.value = err;
-          } else {
-            error.value = 'An error occured';
-          }
+          } else {}
         })
         .finally(() => {

[Killed] BlockStatement
src/composables/useFetch.ts:28:24
             error.value = 'An error occured';
           }
         })
-        .finally(() => {
-          loading.value = false;
-        });
+        .finally(() => {});
     });
   });
killedBy: useFetch devrait récupérer les données après le montage du composant
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/composables/useFetch.ts:29:27
           }
         })
         .finally(() => {
-          loading.value = false;
+          loading.value = true;
         });
     });
killedBy: useFetch devrait récupérer les données après le montage du composant
statusReason: expected true to be false // Object.is equality
