[NoCoverage] BlockStatement
src/composables/useFirestore.ts:20:19
   const data = ref<T[]>([]);
   const error = ref<string | null>(null);
 
-  onMounted(() => {
-    getData();
-  });
+  onMounted(() => {});
 
   const getData = () => {

[NoCoverage] BlockStatement
src/composables/useFirestore.ts:24:25
     getData();
   });
 
-  const getData = () => {
-    getDocs(collection(db, name))
-      .then((querySnapshot) => {
-        data.value = [];
-        let tempData: T[] = [];
-        querySnapshot.forEach((doc) => {
-          tempData.push({ ...doc.data(), id: doc.id } as unknown as T);
-        });
-        data.value = tempData;
-      })
-      .catch((err: unknown) => {
-        if (err instanceof Error) {
-          error.value = err.message;
-        } else if (typeof err === 'string') {
-          error.value = err;
-        } else {
-          error.value = 'An error occured';
-        }
-      });
-  };
+  const getData = () => {};
 
   const deleteItem = async (id: string) => {

[NoCoverage] BlockStatement
src/composables/useFirestore.ts:26:32
 
   const getData = () => {
     getDocs(collection(db, name))
-      .then((querySnapshot) => {
-        data.value = [];
-        let tempData: T[] = [];
-        querySnapshot.forEach((doc) => {
-          tempData.push({ ...doc.data(), id: doc.id } as unknown as T);
-        });
-        data.value = tempData;
-      })
+      .then((querySnapshot) => {})
       .catch((err: unknown) => {
         if (err instanceof Error) {

[NoCoverage] BlockStatement
src/composables/useFirestore.ts:29:40
       .then((querySnapshot) => {
         data.value = [];
         let tempData: T[] = [];
-        querySnapshot.forEach((doc) => {
-          tempData.push({ ...doc.data(), id: doc.id } as unknown as T);
-        });
+        querySnapshot.forEach((doc) => {});
         data.value = tempData;
       })

[NoCoverage] BlockStatement
src/composables/useFirestore.ts:34:32
         });
         data.value = tempData;
       })
-      .catch((err: unknown) => {
-        if (err instanceof Error) {
-          error.value = err.message;
-        } else if (typeof err === 'string') {
-          error.value = err;
-        } else {
-          error.value = 'An error occured';
-        }
-      });
+      .catch((err: unknown) => {});
   };
 

[NoCoverage] BlockStatement
src/composables/useFirestore.ts:45:44
       });
   };
 
-  const deleteItem = async (id: string) => {
-    await deleteDoc(doc(db, name, id));
-    getData();
-  };
+  const deleteItem = async (id: string) => {};
 
   const addItem = async (item: T) => {

[NoCoverage] BlockStatement
src/composables/useFirestore.ts:50:38
     getData();
   };
 
-  const addItem = async (item: T) => {
-    const result = await addDoc(collection(db, name), item);
-    return result.id;
-  };
+  const addItem = async (item: T) => {};
 
   return {

[NoCoverage] ObjectLiteral
src/composables/useFirestore.ts:55:10
     return result.id;
   };
 
-  return {
-    data,
-    deleteItem,
-    addItem,
-  };
+  return {};
 };
 
