[NoCoverage] ObjectLiteral
src/main.ts:19:19
 app.use(createPinia());
 app.use(router);
 
-app.use(PrimeVue, {
-  theme: {
-    preset: Nora,
-  },
-});
+app.use(PrimeVue, {});
 
 app.use(VueQueryPlugin);

[NoCoverage] StringLiteral
src/main.ts:28:15
 app.use(VueQueryPlugin);
 
 app.component('PrivateLayout', PrivateLayout);
-app.component('PublicLayout', PublicLayout);
+app.component("", PublicLayout);
 
 app.mount('#app');
