[NoCoverage] ArrowFunction
src/router/index.ts:18:18
     {
       path: '/login',
       name: 'login',
-      component: () => import('../views/LoginView.vue'),
+      component: () => undefined,
     },
     {

[NoCoverage] StringLiteral
src/router/index.ts:22:13
     },
     {
       path: '/dashboard',
-      name: 'dashboard',
+      name: "",
       component: () => import('../views/Dashboard.vue'),
       meta: {

[NoCoverage] ArrowFunction
src/router/index.ts:23:18
     {
       path: '/dashboard',
       name: 'dashboard',
-      component: () => import('../views/Dashboard.vue'),
+      component: () => undefined,
       meta: {
         requiresAuth: true,

[NoCoverage] BooleanLiteral
src/router/index.ts:25:23
       name: 'dashboard',
       component: () => import('../views/Dashboard.vue'),
       meta: {
-        requiresAuth: true,
+        requiresAuth: false,
         layout: 'PrivateLayout',
       },

[NoCoverage] ArrowFunction
src/router/index.ts:32:18
     {
       path: '/create_cadeau',
       name: 'create_cadeau',
-      component: () => import('../views/CreateCadeau.vue'),
+      component: () => undefined,
       meta: {
         requiresAuth: true,

[NoCoverage] StringLiteral
src/router/index.ts:32:31
     {
       path: '/create_cadeau',
       name: 'create_cadeau',
-      component: () => import('../views/CreateCadeau.vue'),
+      component: () => import(""),
       meta: {
         requiresAuth: true,

[NoCoverage] StringLiteral
src/router/index.ts:35:17
       component: () => import('../views/CreateCadeau.vue'),
       meta: {
         requiresAuth: true,
-        layout: 'PrivateLayout',
+        layout: "",
       },
     },

[NoCoverage] StringLiteral
src/router/index.ts:39:13
       },
     },
     {
-      path: '/about',
+      path: "",
       name: 'about',
       // route level code-splitting

[NoCoverage] ArrowFunction
src/router/index.ts:44:18
       // route level code-splitting
       // this generates a separate chunk (About.[hash].js) for this route
       // which is lazy-loaded when the route is visited.
-      component: () => import('../views/AboutView.vue'),
+      component: () => undefined,
     },
     {

[NoCoverage] StringLiteral
src/router/index.ts:47:13
       component: () => import('../views/AboutView.vue'),
     },
     {
-      path: '/planets',
+      path: "",
       name: 'planets',
       component: PlanetView,

[NoCoverage] StringLiteral
src/router/index.ts:48:13
     },
     {
       path: '/planets',
-      name: 'planets',
+      name: "",
       component: PlanetView,
     },

[NoCoverage] StringLiteral
src/router/index.ts:52:13
       component: PlanetView,
     },
     {
-      path: '/cadeau_api',
+      path: "",
       name: 'cadeau_api',
       component: () => import('../views/CadeauList.vue'),

[NoCoverage] ArrowFunction
src/router/index.ts:54:18
     {
       path: '/cadeau_api',
       name: 'cadeau_api',
-      component: () => import('../views/CadeauList.vue'),
+      component: () => undefined,
     },
     {

[NoCoverage] ObjectLiteral
src/router/index.ts:56:5
       name: 'cadeau_api',
       component: () => import('../views/CadeauList.vue'),
     },
-    {
-      path: '/create_cadeau_api',
-      name: 'create_cadeau_api',
-      component: () => import('../views/CreateCadeaAPI.vue'),
-    },
+    {},
     {
       path: '/cadeau_api/:id',

[NoCoverage] StringLiteral
src/router/index.ts:58:13
     },
     {
       path: '/create_cadeau_api',
-      name: 'create_cadeau_api',
+      name: "",
       component: () => import('../views/CreateCadeaAPI.vue'),
     },

[NoCoverage] ArrowFunction
src/router/index.ts:59:18
     {
       path: '/create_cadeau_api',
       name: 'create_cadeau_api',
-      component: () => import('../views/CreateCadeaAPI.vue'),
+      component: () => undefined,
     },
     {

[NoCoverage] StringLiteral
src/router/index.ts:59:31
     {
       path: '/create_cadeau_api',
       name: 'create_cadeau_api',
-      component: () => import('../views/CreateCadeaAPI.vue'),
+      component: () => import(""),
     },
     {

[NoCoverage] ObjectLiteral
src/router/index.ts:61:5
       name: 'create_cadeau_api',
       component: () => import('../views/CreateCadeaAPI.vue'),
     },
-    {
-      path: '/cadeau_api/:id',
-      name: 'cadeau_api_id',
-      component: () => import('../views/CadeauDetail.vue'),
-    },
+    {},
   ],
 });

[NoCoverage] StringLiteral
src/router/index.ts:62:13
       component: () => import('../views/CreateCadeaAPI.vue'),
     },
     {
-      path: '/cadeau_api/:id',
+      path: "",
       name: 'cadeau_api_id',
       component: () => import('../views/CadeauDetail.vue'),

[NoCoverage] ArrowFunction
src/router/index.ts:64:18
     {
       path: '/cadeau_api/:id',
       name: 'cadeau_api_id',
-      component: () => import('../views/CadeauDetail.vue'),
+      component: () => undefined,
     },
   ],

[NoCoverage] BlockStatement
src/router/index.ts:69:33
   ],
 });
 
-router.beforeEach((to, from) => {
-  if (to.meta.requiresAuth && !useUserStore().userStore) {
-    return '/login';
-  }
-  return true;
-});
+router.beforeEach((to, from) => {});
 
 export default router;

[NoCoverage] LogicalOperator
src/router/index.ts:70:7
 });
 
 router.beforeEach((to, from) => {
-  if (to.meta.requiresAuth && !useUserStore().userStore) {
+  if (to.meta.requiresAuth || !useUserStore().userStore) {
     return '/login';
   }

[NoCoverage] BlockStatement
src/router/index.ts:70:58
 });
 
 router.beforeEach((to, from) => {
-  if (to.meta.requiresAuth && !useUserStore().userStore) {
-    return '/login';
-  }
+  if (to.meta.requiresAuth && !useUserStore().userStore) {}
   return true;
 });
