[NoCoverage] ArrowFunction
src/services/get.planets.ts:1:17
-const waitfor = (ms: number) => new Promise((resolve) => setTimeout(resolve, ms));
+const waitfor = () => undefined;
 
 const getPlanets = async (page = 1) => {

[NoCoverage] ArrowFunction
src/services/get.planets.ts:1:45
-const waitfor = (ms: number) => new Promise((resolve) => setTimeout(resolve, ms));
+const waitfor = (ms: number) => new Promise(() => undefined);
 
 const getPlanets = async (page = 1) => {

[NoCoverage] BlockStatement
src/services/get.planets.ts:3:40
 const waitfor = (ms: number) => new Promise((resolve) => setTimeout(resolve, ms));
 
-const getPlanets = async (page = 1) => {
-  await waitfor(2000);
-  const response = await fetch('https://swapi.dev/api/planets/?page=' + page);
-  const data = await response.json();
-  return data.results;
-};
+const getPlanets = async (page = 1) => {};
 
 export default getPlanets;
