[NoCoverage] BlockStatement
src/stores/cadeau.ts:6:52
 import { defineStore } from 'pinia';
 import { ref, watch } from 'vue';
 
-const useCadeauStore = defineStore('cadeau', () => {
-  const { deleteItem, addItem, data } = useFirestore<Cadeau>('cadeaux');
-  const cadeaux = ref<Cadeau[]>([]);
-
-  watch(data, () => {
-    //console.log('data.value', data.value);
-    cadeaux.value = data.value;
-  });
-
-  const addCadeau = async (cadeau: Cadeau) => {
-    const id = await addItem(cadeau);
-    cadeaux.value = [...cadeaux.value, { ...cadeau, id }];
-  };
-
-  const deleteCadeau = async (id: string) => {
-    await deleteItem(id);
-    cadeaux.value = cadeaux.value.filter((cadeau) => cadeau.id !== id);
-  };
-
-  return {
-    addCadeau,
-    deleteCadeau,
-    cadeaux,
-  };
-});
+const useCadeauStore = defineStore('cadeau', () => {});
 
 export default useCadeauStore;

[NoCoverage] StringLiteral
src/stores/cadeau.ts:7:62
 import { ref, watch } from 'vue';
 
 const useCadeauStore = defineStore('cadeau', () => {
-  const { deleteItem, addItem, data } = useFirestore<Cadeau>('cadeaux');
+  const { deleteItem, addItem, data } = useFirestore<Cadeau>("");
   const cadeaux = ref<Cadeau[]>([]);
 

[NoCoverage] ArrayDeclaration
src/stores/cadeau.ts:8:33
 
 const useCadeauStore = defineStore('cadeau', () => {
   const { deleteItem, addItem, data } = useFirestore<Cadeau>('cadeaux');
-  const cadeaux = ref<Cadeau[]>([]);
+  const cadeaux = ref<Cadeau[]>(["Stryker was here"]);
 
   watch(data, () => {

[NoCoverage] BlockStatement
src/stores/cadeau.ts:10:21
   const { deleteItem, addItem, data } = useFirestore<Cadeau>('cadeaux');
   const cadeaux = ref<Cadeau[]>([]);
 
-  watch(data, () => {
-    //console.log('data.value', data.value);
-    cadeaux.value = data.value;
-  });
+  watch(data, () => {});
 
   const addCadeau = async (cadeau: Cadeau) => {

[NoCoverage] BlockStatement
src/stores/cadeau.ts:15:47
     cadeaux.value = data.value;
   });
 
-  const addCadeau = async (cadeau: Cadeau) => {
-    const id = await addItem(cadeau);
-    cadeaux.value = [...cadeaux.value, { ...cadeau, id }];
-  };
+  const addCadeau = async (cadeau: Cadeau) => {};
 
   const deleteCadeau = async (id: string) => {

[NoCoverage] ObjectLiteral
src/stores/cadeau.ts:17:40
 
   const addCadeau = async (cadeau: Cadeau) => {
     const id = await addItem(cadeau);
-    cadeaux.value = [...cadeaux.value, { ...cadeau, id }];
+    cadeaux.value = [...cadeaux.value, {}];
   };
 

[NoCoverage] ArrayDeclaration
src/stores/cadeau.ts:17:21
 
   const addCadeau = async (cadeau: Cadeau) => {
     const id = await addItem(cadeau);
-    cadeaux.value = [...cadeaux.value, { ...cadeau, id }];
+    cadeaux.value = [];
   };
 

[NoCoverage] BlockStatement
src/stores/cadeau.ts:20:46
     cadeaux.value = [...cadeaux.value, { ...cadeau, id }];
   };
 
-  const deleteCadeau = async (id: string) => {
-    await deleteItem(id);
-    cadeaux.value = cadeaux.value.filter((cadeau) => cadeau.id !== id);
-  };
+  const deleteCadeau = async (id: string) => {};
 
   return {

[NoCoverage] MethodExpression
src/stores/cadeau.ts:22:21
 
   const deleteCadeau = async (id: string) => {
     await deleteItem(id);
-    cadeaux.value = cadeaux.value.filter((cadeau) => cadeau.id !== id);
+    cadeaux.value = cadeaux.value;
   };
 

[NoCoverage] EqualityOperator
src/stores/cadeau.ts:22:54
 
   const deleteCadeau = async (id: string) => {
     await deleteItem(id);
-    cadeaux.value = cadeaux.value.filter((cadeau) => cadeau.id !== id);
+    cadeaux.value = cadeaux.value.filter((cadeau) => cadeau.id === id);
   };
 
