[Killed] ArrowFunction
src/views/CadeauList.vue:10:12
 
 const { data, isLoading, error } = useQuery({
   queryKey: ['cadeaux'],
-  queryFn: () => getCadeaux(),
+  queryFn: () => undefined,
   staleTime: 5000,
 });
killedBy: CadeauxView component renders loading state and displays data
statusReason: expected '<div>\n  <p>Cadeaux</p>\n  <p>test</p…' to contain 'Cadeau 1'

[NoCoverage] BlockStatement
src/views/CadeauList.vue:16:38
 
 const queryClient = useQueryClient();
 
-const prefetchData = (id: string) => {
-  queryClient.prefetchQuery(getCadeauConfig(id));
-};
+const prefetchData = (id: string) => {};
 
 const { mutate } = useMutation({

[Killed] ObjectLiteral
src/views/CadeauList.vue:20:32
   queryClient.prefetchQuery(getCadeauConfig(id));
 };
 
-const { mutate } = useMutation({
-  mutationFn: (id: string) => deleteCadeau(id),
-  onMutate: async (id) => {
-    const previousCadeaux = queryClient.getQueryData(['cadeaux']);
-    queryClient.setQueryData(['cadeaux'], (old: Cadeau[]) =>
-      old.filter((cadeau) => cadeau._id !== id),
-    );
-    return { previousCadeaux };
-  },
-  onError: (err, newTodo, context) => {
-    queryClient.setQueryData(['cadeaux'], context?.previousCadeaux);
-  },
-  mutationKey: ['deleteCadeau'],
-});
+const { mutate } = useMutation({});
 </script>
 
killedBy: CadeauxView component calls deleteCadeau and updates the list when delete button is clicked
statusReason: expected "spy" to be called with arguments: [ '1' ]

Received: 



Number of calls: 0

[Killed] ArrowFunction
src/views/CadeauList.vue:21:15
 };
 
 const { mutate } = useMutation({
-  mutationFn: (id: string) => deleteCadeau(id),
+  mutationFn: () => undefined,
   onMutate: async (id) => {
     const previousCadeaux = queryClient.getQueryData(['cadeaux']);
killedBy: CadeauxView component calls deleteCadeau and updates the list when delete button is clicked
statusReason: expected "spy" to be called with arguments: [ '1' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/views/CadeauList.vue:22:27
 
 const { mutate } = useMutation({
   mutationFn: (id: string) => deleteCadeau(id),
-  onMutate: async (id) => {
-    const previousCadeaux = queryClient.getQueryData(['cadeaux']);
-    queryClient.setQueryData(['cadeaux'], (old: Cadeau[]) =>
-      old.filter((cadeau) => cadeau._id !== id),
-    );
-    return { previousCadeaux };
-  },
+  onMutate: async (id) => {},
   onError: (err, newTodo, context) => {
     queryClient.setQueryData(['cadeaux'], context?.previousCadeaux);
killedBy: CadeauxView component calls deleteCadeau and updates the list when delete button is clicked
statusReason: expected '<div>\n  <p>Cadeaux</p>\n  <p>test</p…' not to contain 'Cadeau 1'

[Killed] ArrowFunction
src/views/CadeauList.vue:24:43
   mutationFn: (id: string) => deleteCadeau(id),
   onMutate: async (id) => {
     const previousCadeaux = queryClient.getQueryData(['cadeaux']);
-    queryClient.setQueryData(['cadeaux'], (old: Cadeau[]) =>
-      old.filter((cadeau) => cadeau._id !== id),
+    queryClient.setQueryData(['cadeaux'], () => undefined,
     );
     return { previousCadeaux };
killedBy: CadeauxView component calls deleteCadeau and updates the list when delete button is clicked
statusReason: expected '<div>\n  <p>Cadeaux</p>\n  <p>test</p…' not to contain 'Cadeau 1'

[Killed] EqualityOperator
src/views/CadeauList.vue:25:30
   onMutate: async (id) => {
     const previousCadeaux = queryClient.getQueryData(['cadeaux']);
     queryClient.setQueryData(['cadeaux'], (old: Cadeau[]) =>
-      old.filter((cadeau) => cadeau._id !== id),
+      old.filter((cadeau) => cadeau._id === id),
     );
     return { previousCadeaux };
killedBy: CadeauxView component calls deleteCadeau and updates the list when delete button is clicked
statusReason: expected '<div>\n  <p>Cadeaux</p>\n  <p>test</p…' not to contain 'Cadeau 1'

[Killed] ArrowFunction
src/views/CadeauList.vue:25:18
   onMutate: async (id) => {
     const previousCadeaux = queryClient.getQueryData(['cadeaux']);
     queryClient.setQueryData(['cadeaux'], (old: Cadeau[]) =>
-      old.filter((cadeau) => cadeau._id !== id),
+      old.filter(() => undefined),
     );
     return { previousCadeaux };
killedBy: CadeauxView component calls deleteCadeau and updates the list when delete button is clicked
statusReason: expected '<div>\n  <p>Cadeaux</p>\n  <p>test</p…' to contain 'Cadeau 2'

[NoCoverage] BlockStatement
src/views/CadeauList.vue:29:39
     );
     return { previousCadeaux };
   },
-  onError: (err, newTodo, context) => {
-    queryClient.setQueryData(['cadeaux'], context?.previousCadeaux);
-  },
+  onError: (err, newTodo, context) => {},
   mutationKey: ['deleteCadeau'],
 });

[NoCoverage] OptionalChaining
src/views/CadeauList.vue:30:43
     return { previousCadeaux };
   },
   onError: (err, newTodo, context) => {
-    queryClient.setQueryData(['cadeaux'], context?.previousCadeaux);
+    queryClient.setQueryData(['cadeaux'], context.previousCadeaux);
   },
   mutationKey: ['deleteCadeau'],

[Survived] ArrayDeclaration
src/views/CadeauList.vue:32:16
   onError: (err, newTodo, context) => {
     queryClient.setQueryData(['cadeaux'], context?.previousCadeaux);
   },
-  mutationKey: ['deleteCadeau'],
+  mutationKey: [],
 });
 </script>

[Survived] StringLiteral
src/views/CadeauList.vue:32:17
   onError: (err, newTodo, context) => {
     queryClient.setQueryData(['cadeaux'], context?.previousCadeaux);
   },
-  mutationKey: ['deleteCadeau'],
+  mutationKey: [""],
 });
 </script>
