[NoCoverage] StringLiteral
src/views/CreateCadeaAPI.vue:11:19
 import { db } from '@/lib/firebase';
 import { useRouter } from 'vue-router';
 
-const title = ref('');
+const title = ref("Stryker was here!");
 const description = ref('');
 const price = ref(0);

[NoCoverage] BlockStatement
src/views/CreateCadeaAPI.vue:17:30
 
 const navigate = useRouter();
 
-const onSubmit = async () => {
-  console.log(title.value, description.value, price.value);
-  const results = cadeauSchema.safeParse({
-    title: title.value,
-    description: description.value,
-    price: price.value,
-  });
-  if (!results.success) {
-    console.log(results.error.errors);
-    return;
-  }
-  console.log(results.data);
-
-  //https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f
-
-  await fetch('https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau', {
-    method: 'POST',
-    headers: {
-      'Content-Type': 'application/json',
-    },
-    body: JSON.stringify(results.data),
-  });
-
-  navigate.push({ name: 'cadeau_api' });
-};
+const onSubmit = async () => {};
 </script>
 

[NoCoverage] BooleanLiteral
src/views/CreateCadeaAPI.vue:24:7
     description: description.value,
     price: price.value,
   });
-  if (!results.success) {
+  if (results.success) {
     console.log(results.error.errors);
     return;

[NoCoverage] ConditionalExpression
src/views/CreateCadeaAPI.vue:24:7
     description: description.value,
     price: price.value,
   });
-  if (!results.success) {
+  if (false) {
     console.log(results.error.errors);
     return;

[NoCoverage] StringLiteral
src/views/CreateCadeaAPI.vue:32:15
 
   //https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f
 
-  await fetch('https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau', {
+  await fetch("", {
     method: 'POST',
     headers: {

[NoCoverage] ObjectLiteral
src/views/CreateCadeaAPI.vue:32:83
 
   //https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f
 
-  await fetch('https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau', {
-    method: 'POST',
-    headers: {
-      'Content-Type': 'application/json',
-    },
-    body: JSON.stringify(results.data),
-  });
+  await fetch('https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau', {});
 
   navigate.push({ name: 'cadeau_api' });

[NoCoverage] ObjectLiteral
src/views/CreateCadeaAPI.vue:40:17
     body: JSON.stringify(results.data),
   });
 
-  navigate.push({ name: 'cadeau_api' });
+  navigate.push({});
 };
 </script>
