[NoCoverage] StringLiteral
src/views/CreateCadeau.vue:12:25
 import { useRouter } from 'vue-router';
 
 const title = ref('');
-const description = ref('');
+const description = ref("Stryker was here!");
 const price = ref(0);
 

[NoCoverage] BlockStatement
src/views/CreateCadeau.vue:17:24
 
 const navigate = useRouter();
 
-const onSubmit = () => {
-  console.log(title.value, description.value, price.value);
-  const results = cadeauSchema.safeParse({
-    title: title.value,
-    description: description.value,
-    price: price.value,
-  });
-  if (!results.success) {
-    console.log(results.error.errors);
-    return;
-  }
-  console.log(results.data);
-
-  addDoc(collection(db, 'cadeaux'), results.data)
-    .then((docRef) => {
-      console.log('Document written with ID: ', docRef.id);
-      navigate.back();
-    })
-    .catch((error) => {
-      console.error('Error adding document: ', error);
-    });
-};
+const onSubmit = () => {};
 </script>
 

[NoCoverage] ConditionalExpression
src/views/CreateCadeau.vue:24:7
     description: description.value,
     price: price.value,
   });
-  if (!results.success) {
+  if (true) {
     console.log(results.error.errors);
     return;

[NoCoverage] StringLiteral
src/views/CreateCadeau.vue:30:25
   }
   console.log(results.data);
 
-  addDoc(collection(db, 'cadeaux'), results.data)
+  addDoc(collection(db, ""), results.data)
     .then((docRef) => {
       console.log('Document written with ID: ', docRef.id);

[NoCoverage] BlockStatement
src/views/CreateCadeau.vue:31:23
   console.log(results.data);
 
   addDoc(collection(db, 'cadeaux'), results.data)
-    .then((docRef) => {
-      console.log('Document written with ID: ', docRef.id);
-      navigate.back();
-    })
+    .then((docRef) => {})
     .catch((error) => {
       console.error('Error adding document: ', error);
