[NoCoverage] BlockStatement
src/views/Dashboard.vue:14:38
 const { deleteCadeau } = cadeauStore;
 const { cadeaux } = storeToRefs(cadeauStore);
 
-const removeCadeau = (id: string) => {
-  deleteCadeau(id)
-    .then(() => {
-      console.log('deleted');
-    })
-    .catch((error) => {
-      console.error(error);
-    });
-};
+const removeCadeau = (id: string) => {};
 </script>
 

[NoCoverage] BlockStatement
src/views/Dashboard.vue:16:17
 
 const removeCadeau = (id: string) => {
   deleteCadeau(id)
-    .then(() => {
-      console.log('deleted');
-    })
+    .then(() => {})
     .catch((error) => {
       console.error(error);
