[NoCoverage] StringLiteral
src/views/PlanetView.vue:24:14
 const page = ref(1);
 
 const { data } = useQuery({
-  queryKey: ['planets', page],
+  queryKey: ["", page],
   queryFn: () => getPlanets(page.value),
   staleTime: 5000,

[NoCoverage] ArrowFunction
src/views/PlanetView.vue:25:12
 
 const { data } = useQuery({
   queryKey: ['planets', page],
-  queryFn: () => getPlanets(page.value),
+  queryFn: () => undefined,
   staleTime: 5000,
 });
