[NoCoverage] StringLiteral
src/views/RegisterView.vue:10:19
 import { auth } from '@/lib/firebase';
 import { useRouter } from 'vue-router';
 
-const email = ref('');
+const email = ref("Stryker was here!");
 const password = ref('');
 

[NoCoverage] ArrayDeclaration
src/views/RegisterView.vue:13:29
 const email = ref('');
 const password = ref('');
 
-const error = ref<string[]>([]);
+const error = ref<string[]>(["Stryker was here"]);
 
 const navigate = useRouter();

[NoCoverage] BlockStatement
src/views/RegisterView.vue:17:22
 
 const navigate = useRouter();
 
-const submit = () => {
-  const result = registerSchema.safeParse({ email: email.value, password: password.value });
-  if (!result.success) {
-    error.value = result.error.errors.map((e) => e.message);
-    return;
-  }
-  error.value = [];
-  createUserWithEmailAndPassword(auth, result.data.email, result.data.password)
-    .then((userCredential) => {
-      const user = userCredential.user;
-      console.log(user);
-      navigate.push({ name: 'login' });
-    })
-    .catch((error) => {
-      console.error(error);
-      navigate.push({ name: 'login' });
-    });
-};
+const submit = () => {};
 </script>
 

[NoCoverage] ConditionalExpression
src/views/RegisterView.vue:19:7
 
 const submit = () => {
   const result = registerSchema.safeParse({ email: email.value, password: password.value });
-  if (!result.success) {
+  if (true) {
     error.value = result.error.errors.map((e) => e.message);
     return;

[NoCoverage] BooleanLiteral
src/views/RegisterView.vue:19:7
 
 const submit = () => {
   const result = registerSchema.safeParse({ email: email.value, password: password.value });
-  if (!result.success) {
+  if (result.success) {
     error.value = result.error.errors.map((e) => e.message);
     return;

[NoCoverage] ArrowFunction
src/views/RegisterView.vue:20:43
 const submit = () => {
   const result = registerSchema.safeParse({ email: email.value, password: password.value });
   if (!result.success) {
-    error.value = result.error.errors.map((e) => e.message);
+    error.value = result.error.errors.map(() => undefined);
     return;
   }

[NoCoverage] BlockStatement
src/views/RegisterView.vue:25:31
   }
   error.value = [];
   createUserWithEmailAndPassword(auth, result.data.email, result.data.password)
-    .then((userCredential) => {
-      const user = userCredential.user;
-      console.log(user);
-      navigate.push({ name: 'login' });
-    })
+    .then((userCredential) => {})
     .catch((error) => {
       console.error(error);

[NoCoverage] BlockStatement
src/views/RegisterView.vue:30:23
       console.log(user);
       navigate.push({ name: 'login' });
     })
-    .catch((error) => {
-      console.error(error);
-      navigate.push({ name: 'login' });
-    });
+    .catch((error) => {});
 };
 </script>
