[Killed] BlockStatement
src/services/delete.cadeaux.ts:3:51
 const waitfor = (ms: number) => new Promise((resolve) => setTimeout(resolve, ms));
 
-export const deleteCadeau = async (id: string) => {
-  await waitfor(2000);
-  const response = await fetch(
-    `https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau/${id}`,
-    { method: 'DELETE' },
-  );
-  return true;
-};
+export const deleteCadeau = async (id: string) => {};
 
killedBy: deleteCadeau devrait supprimer le cadeau après un délai de 2000ms
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/services/delete.cadeaux.ts:6:5
 export const deleteCadeau = async (id: string) => {
   await waitfor(2000);
   const response = await fetch(
-    `https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau/${id}`,
+    ``,
     { method: 'DELETE' },
   );
killedBy: deleteCadeau devrait supprimer le cadeau après un délai de 2000ms
statusReason: expected "fetch" to be called with arguments: [ …(2) ]

Received: 

  1st fetch call:

  [
-   "https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau/1",
