[Killed] BlockStatement
src/services/get.cadeaux.ts:3:40
 //https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f
 
-const getCadeaux = async (page = 1) => {
-  const response = await fetch('https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau');
-  const data = await response.json();
-  return data;
-};
+const getCadeaux = async (page = 1) => {};
 
 export default getCadeaux;
killedBy: Tests des fonctions API cadeau getCadeaux devrait récupérer la liste des cadeaux
statusReason: expected undefined to deeply equal [ { _id: '1', nom: 'Cadeau A' } ]

[Killed] BlockStatement
src/services/get.cadeaux.ts:13:41
 
 const waitfor = (ms: number) => new Promise((resolve) => setTimeout(resolve, ms));
 
-const getCadeau = async (id: string) => {
-  await waitfor(2000);
-  const response = await fetch(
-    `https://crudcrud.com/api/c14232f51d1743ebac078af7a29af39f/cadeau/${id}`,
-  );
-  const data = await response.json();
-  return data;
-};
+const getCadeau = async (id: string) => {};
 
 export const getCadeauConfig = (id: string) => ({
killedBy: Tests des fonctions API cadeau getCadeauConfig devrait récupérer les détails d’un cadeau avec un délai de 2000ms
statusReason: expected undefined to deeply equal { _id: '1', nom: 'Cadeau A Detail' }

[Killed] ArrowFunction
src/services/get.cadeaux.ts:22:32
   return data;
 };
 
-export const getCadeauConfig = (id: string) => ({
-  queryKey: ['cadeau', id],
-  queryFn: () => getCadeau(id as string),
-  staleTime: 5000,
-  refetchOnWindowFocus: true,
-});
+export const getCadeauConfig = () => undefined;
 
killedBy: Tests des fonctions API cadeau getCadeauConfig devrait récupérer les détails d’un cadeau avec un délai de 2000ms
statusReason: Cannot destructure property 'queryFn' of '(0 , getCadeauConfig)(...)' as it is undefined.

[Killed] ObjectLiteral
src/services/get.cadeaux.ts:22:49
   return data;
 };
 
-export const getCadeauConfig = (id: string) => ({
-  queryKey: ['cadeau', id],
-  queryFn: () => getCadeau(id as string),
-  staleTime: 5000,
-  refetchOnWindowFocus: true,
-});
+export const getCadeauConfig = (id: string) => ({});
 
killedBy: Tests des fonctions API cadeau getCadeauConfig devrait récupérer les détails d’un cadeau avec un délai de 2000ms
statusReason: queryFn is not a function

[Survived] StringLiteral
src/services/get.cadeaux.ts:23:14
 };
 
 export const getCadeauConfig = (id: string) => ({
-  queryKey: ['cadeau', id],
+  queryKey: ["", id],
   queryFn: () => getCadeau(id as string),
   staleTime: 5000,

[Killed] ArrowFunction
src/services/get.cadeaux.ts:24:12
 
 export const getCadeauConfig = (id: string) => ({
   queryKey: ['cadeau', id],
-  queryFn: () => getCadeau(id as string),
+  queryFn: () => undefined,
   staleTime: 5000,
   refetchOnWindowFocus: true,
killedBy: Tests des fonctions API cadeau getCadeauConfig devrait récupérer les détails d’un cadeau avec un délai de 2000ms
statusReason: expected undefined to deeply equal { _id: '1', nom: 'Cadeau A Detail' }

[Survived] BooleanLiteral
src/services/get.cadeaux.ts:26:25
   queryKey: ['cadeau', id],
   queryFn: () => getCadeau(id as string),
   staleTime: 5000,
-  refetchOnWindowFocus: true,
+  refetchOnWindowFocus: false,
 });
 
