[Killed] BlockStatement
src/stores/user.ts:4:48
 import { defineStore } from 'pinia';
 import { ref } from 'vue';
 
-const useUserStore = defineStore('user', () => {
-  const email = ref('');
-
-  const setUser = (email1: string) => {
-    email.value = email1;
-  };
-
-  return {
-    setUser,
-    userStore: email,
-  };
-});
+const useUserStore = defineStore('user', () => {});
 
 export default useUserStore;
killedBy: useUserStore should have an initial empty email
statusReason: expected undefined to be '' // Object.is equality

[Survived] StringLiteral
src/stores/user.ts:4:34
 import { defineStore } from 'pinia';
 import { ref } from 'vue';
 
-const useUserStore = defineStore('user', () => {
+const useUserStore = defineStore("", () => {
   const email = ref('');
 

[Killed] BlockStatement
src/stores/user.ts:7:39
 const useUserStore = defineStore('user', () => {
   const email = ref('');
 
-  const setUser = (email1: string) => {
-    email.value = email1;
-  };
+  const setUser = (email1: string) => {};
 
   return {
killedBy: useUserStore should set user email
statusReason: expected '' to be 'test@example.com' // Object.is equality
