[Survived] MethodExpression
src/schemas/register.schema.ts:5:13
 
 export const registerSchema = z.object({
   email: z.string().email(),
-  password: z
-    .string()
-    .min(6, 'Password must be at least 6 characters')
+  password: z.string().max(6, 'Password must be at least 6 characters')
     .max(32)
     .regex(

[Survived] MethodExpression
src/schemas/register.schema.ts:5:13
 
 export const registerSchema = z.object({
   email: z.string().email(),
-  password: z
-    .string()
-    .min(6, 'Password must be at least 6 characters')
-    .max(32)
+  password: z.string().min(6, 'Password must be at least 6 characters').min(32)
     .regex(
       /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d).{6,32}$/,

[Survived] Regex
src/schemas/register.schema.ts:10:7
     .min(6, 'Password must be at least 6 characters')
     .max(32)
     .regex(
-      /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d).{6,32}$/,
+      /^(?=.*[^a-z])(?=.*[A-Z])(?=.*\d).{6,32}$/,
       'Password must contain at least one uppercase letter, one lowercase letter, and one number',
     ),

[Survived] Regex
src/schemas/register.schema.ts:10:7
     .min(6, 'Password must be at least 6 characters')
     .max(32)
     .regex(
-      /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d).{6,32}$/,
+      /^(?=.*[a-z])(?=.*[A-Z])(?=.*\D).{6,32}$/,
       'Password must contain at least one uppercase letter, one lowercase letter, and one number',
     ),

[Survived] StringLiteral
src/schemas/register.schema.ts:11:7
     .max(32)
     .regex(
       /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d).{6,32}$/,
-      'Password must contain at least one uppercase letter, one lowercase letter, and one number',
+      "",
     ),
 });
